Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་ཟེར་སྣང་བ་མཐའ་ཡས་ཞེས་བྱ་བ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: He was a thus-gone, worthy, perfect buddha, someone learned and virtuous, a blissful one, a knower of the world, a charioteer who guides beings, an unsurpassed being, and a teacher of gods and humans.

source: ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་འོད་ཟེར་སྣང་བ་མཐའ་ཡས་ཞེས་བྱ་ཞེ་ན།
en: Why was he called Infinite Light?

source: བཅོམ་ལྡན་འདས་དེ་ཐམས་ཅད་མཁྱེན་པ་མ་ཐོབ་ཅིང་བྱང་ཆུབ་སེམས་དཔར་གྱུར་བཞིན་དུ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་ནས་ལུས་ལས་འོད་འདི་ལྟ་བུ་ཕྱུང་སྟེ།
en: Before that blessed one attained omniscience and was still a bodhisattva, he sat at the seat of awakening and light issued forth from his body.

source: འོད་རབ་ཏུ་ཕྱུང་བ་དེས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་གྲངས་མེད་བགྲང་བ་ལས་ཤིན་ཏུ་འདས་པ་དག་སྣང་བ་ཆེན་པོས་གསལ་བར་གྱུར་ཏོ། །
en: The light illuminated immeasurable, countless, and incalculable buddha realms throughout the ten directions with a brilliant glow.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཕྱིར་མི་ལྡོག་པ་དང་། སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་འཁོད་པ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པ་དེ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་དེ་ག་ལ་བ་དེ་ལོགས་སུ་མེ་ཏོག་དག་གཏོར་ཏོ། །
en: All the bodhisattvas who are irreversibly destined for awakening, as well as the bodhisattvas in their last lives, in those buddha realms beheld the bodhisattva seated at the seat of awakening and threw flowers in his direction.

source: གཏོར་བ་དང་། སངས་རྒྱས་ཀྱི་མཐུས་འོངས་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ལུས་ལ་བབ་བོ། །
en: Through the power of the buddhas, when they threw those flowers, they landed on the bodhisattva’s body.

source: མེ་ཏོག་དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་ཤིན་ཏུ་སྤྲུལ་པ་དེར་མི་བདུན་གྱི་འཕང་ཙམ་གྱི་མེ་ཏོག་བཀྲམ་པ་གཅིག་པུ་གནས་པར་གྱུར་ཏོ། །
en: The flowers formed a single pile of flowers the height of seven men in the world Emanation.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་དབང་ཆེ་བ་དབང་ཆེ་བར་གྲགས་པའི་ལྷ་གང་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་གང་དག་འཁོད་པ་དེ་དག་གིས་འོད་
en: The gods renowned for their power and the bodhisattvas in that world saw the light.

source: དེ་མཐོང་ནས་གང་འདི་ལྟ་བུ་རྣམ་པར་དག་པའི་འོད་བྱུང་བ་ལས་ན་ཀྱེ་མ་འདི་ནི་ད་དེ་བཞིན་གཤེགས་པའི་འོད་ཟེར་སྣང་བ་མཐའ་ཡས་སུ་འགྱུར་རོ་ཞེས་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་དེ
en: Upon seeing this pure light, they exclaimed, ‘He will become the Thus-Gone Infinite Light!’

source: དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་འོད་ཟེར་སྣང་བ་མཐའ་ཡས། འོད་ཟེར་སྣང་བ་མཐའ་ཡས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Thus this thus-gone one’s name became known as Infinite Light.

source: ཅིའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཤིན་ཏུ་སྤྲུལ་པ་ཞེས་བྱ་ཞེ་ན།
en: “Why was the world called Emanation?

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་འཁོད་པའི་མི་དེ་དག་གི་ལོངས་སྤྱོད་དང་ཡོངས་སུ་སྤྱད་པ་ནི་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་བུ་རྣམས་ཀྱི་ལོངས་སྤྱོད་དང་ཡོངས་སུ་སྤྱད་པ་ཅི་འདྲ་བ་དེ་འདྲ་བར་གྱུར་པས་
en: The wealth and enjoyments possessed by the people in this world were like those of the gods in the Heaven of Making Use of Others’ Emanations.

source: དེའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཤིན་ཏུ་སྤྲུལ་པ་ཞེས་བྱའོ། །
en: Thus this world was called Emanation.

source: ཅིའི་ཕྱིར་བསྐལ་པ་དེ་སྐར་མདོག་ཅེས་བྱ་ཞེ་ན།
en: “Why was the eon called Star-Color?

source: བློ་གྲོས་རྒྱ་མཚོ་བསྐལ་པ་ཁྲི་འདས་ནས་བསྐལ་པ་དེ་ལ་སངས་རྒྱས་བྱུང་བར་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་སྐར་མ་ལ་དགའ་བ་ཞེས་བྱ་བ་བྱུང་ངོ་། །
en: Ten thousand eons earlier, Sāgaramati, a thus-gone one called Lover of the Stars had appeared.

source: གང་གི་འོག་ཏུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་སྣང་བ་མཐའ་ཡས་དེས་བྱང་ཆུབ་ཐོབ་པའི་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་གྱིས་བསྐལ་པ་དེ་སྐར་མདོག་ཅེས་བྱའོ། །
en: Since the blessed thus-gone Infinite Light attained awakening following that thus-gone one, the eon was called Star-Color after his name.

source: བློ་གྲོས་རྒྱ་མཚོ་བསྐལ་པ་དེ་ལ་དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཕྲག་བཅུ་བཞི་བྱུང་ངོ་། །
en: Sāgaramati, one hundred forty million thus-gone ones appeared in that eon.

source: བློ་གྲོས་རྒྱ་མཚོ་འཇིག་རྟེན་གྱི་ཁམས་ཤིན་ཏུ་སྤྲུལ་པ་དེ་ནི་འབྱོར་པ་རྒྱས་པ་ཞི་བ་ལོ་ལེགས་པ་ལྷ་དང་མིས་གང་བ། ཡངས་ཤིང་ཐ་གྲུ་ཆེ་བར་གྱུར་ཏེ། གླིང་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དྲུག་ཡོད་དོ། །གླིང་རེ་རེའི་ཚད་ཀྱང་དཔག་ཚད་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་ཡོད་དོ། །
en: “Sāgaramati, the world called Emanation was well-off, peaceful, had abundant harvests, was filled with gods and humans, was vast and open, and consisted of 960 trillion continents, each of which measured 8,400,000 leagues.

source: དཔག་ཚད་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་རེ་རེ་ལ་ཡང་གྲོང་ཁྱེར་བརྒྱད་ཁྲི་བཞི་སྟོང་བཞི་སྟོང་ཡོད་པར་གྱུར་ཏོ། །
en: In each of these continents that measured 8,400,000 leagues were eighty-four thousand cities.

source: གྲོང་ཁྱེར་རེ་རེ་ཡང་གྲོང་དང་ཚོང་འདུས་དང་རི་འོར་གྱི་གྲོང་བརྒྱད་ཁྲི་བཞི་སྟོང་བཞི་སྟོང་གིས་ཀུན་ནས་བསྐོར་བར་གྱུར་ཏོ། །གྲོང་ཁྱེར་དེ་དག་ཐམས་ཅད་ན་ཡང་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུ་བཅུ་ཡོད་པར་གྱུར་ཏོ། །
en: Eighty-four thousand villages, markets, and outlying settlements surrounded each city. In each city were ten trillion people.

source: གྲོང་དང་ཚོང་འདུས་དང་རི་འོར་གྱི་གྲོང་དེ་དག་ཐམས་ཅད་ན་ཡང་མིའི་སྐྱེ་དགུའི་སྲོག་ཆགས་བྱེ་བ་ཕྲག་བརྒྱད་བརྒྱད་གནས་པར་གྱུར་ཏོ། །
en: In each village, market, and outlying settlement were eighty million people.

source: དབང་ཆེ་བ་དབང་ཆེ་བར་གྲགས་པའི་མི་རྣམས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ། དེ་ལྟར་འཇིག་རྟེན་གྱི་ཁམས་དེ་རྒྱས་པར་གྱུར་ཏོ། །
en: There is of course no need to mention that they were powerful people.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་གསེར་དང་དངུལ་དང་ཤེལ་དང་བཻ་དཱུརྱ་དང་རིན་པོ་ཆེ་སྣ་བཞི་ལས་གྲུབ་པར་གྱུར་ཏོ། །
en: The world was formed of gold, silver, crystal, beryl, and four types of jewels.

source: དེ་ན་བཟའ་བ་དང་བཏུང་བ་དང་གོས་དང་རྒྱན་དང་ཡོངས་སུ་སྤྱད་པ་དག་བསམས་པ་ཙམ་གྱིས་འབྱོར་ཏོ། །
en: Food, drink, clothing, jewelry, and enjoyments were available at one’s wish.

source: ལྷ་དང་མི་དེ་དག་ཀྱང་ང་ཡི་བ་མེད་ཅིང་ཡོངས་སུ་འཛིན་པ་མེད་པར་གྱུར་ཏོ། །
en: The gods and humans were free from grasping and had no thoughts of personal possession.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་སྣང་བ་མཐའ་ཡས་དེའི་ཚེའི་ཚད་ནི་བར་གྱི་བསྐལ་པ་བཅུ་ཐུབ་པར་གྱུར་ཏོ། །
en: The lifespan of the blessed thus-gone Infinite Light was ten intermediate eons.

source: དེའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཆེན་པོ་ནི་ཉན་ཐོས་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་ཡོད་དོ། །
en: There were 300 trillion hearers in his great saṅgha of hearers.

source: བྱང་ཆུབ་སེམས་དཔའི་འདུས་པ་ཆེན་པོ་ནི་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་བརྒྱ་ཕྲག་བཅུ་གཉིས་ཡོད་དོ། །
en: There were one billion and two hundred million bodhisattvas in his great assembly of bodhisattvas.

source: རྒྱལ་པོའི་ཕོ་བྲང་གྲོང་ཁྱེར་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་ནི་བཅོམ་ལྡན་འདས་དེའི་སྐུ་སྐྱེ་བའི་སར་གྱུར་ཏོ། །
en: The birthplace of the Blessed One was the royal palace known as Pure City.

source: བཅོམ་ལྡན་འདས་དེ་དེ་ནས་མངོན་པར་བྱུང་ནས་བཅོམ་ལྡན་འདས་དེ་གྲོང་ཁྱེར་ཆེན་པོ་དགའ་བ་འབྱུང་བ་ཞེས་བྱ་བར་གནས་ཏེ་བཞུགས་སོ། །
en: Having left the palace, the Blessed One now lived in the city called Source of Happiness.

source: བློ་གྲོས་རྒྱ་མཚོ་དེའི་ཚེ་དེའི་དུས་ན་གྲོང་ཁྱེར་ཆེན་པོ་དགའ་བ་འབྱུང་བ་དེར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་དབང་ཕྱུག་རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: “At that time, Sāgaramati, there was a universal monarch named Pure Domain in that city, who ruled over the worlds of the trichiliocosm and controlled the seven precious possessions.

source: དེའི་རིན་པོ་ཆེ་སྣ་བདུན་ནི་འདི་ལྟ་སྟེ། འདི་ལྟར་འཁོར་ལོ་རིན་པོ་ཆེ་དང་། གླང་པོ་རིན་པོ་ཆེ་དང་། རྟ་རིན་པོ་ཆེ་དང་། བུད་མེད་རིན་པོ་ཆེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། ཁྱིམ་བདག་རིན་པོ་ཆེ་དང་། བློན་པོ་རིན་པོ་ཆེ་དང་བདུན་ནོ། །
en: His seven precious possessions were: the precious wheel, the precious elephant, the precious horse, the precious queen, the precious jewel, the precious steward, and the precious minister.

source: རྒྱལ་པོ་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པ་དེ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་པར་གྱུར་ཏེ།
en: King Pure Domain had set forth toward unsurpassed and perfect awakening.

source: ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པས་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་ཞེ་འགྲས་པ་མེད་པའོ། །
en: He was without aggression toward any being because of the abundance of his altruism.

source: རྒྱལ་པོ་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པ་དེའི་བཙུན་མོའི་འཁོར་གྱི་བུད་མེད་ནི་བྱེ་བ་ཕྲག་བཞི་ཡོད་དེ།
en: There were forty million women in King Pure Domain’s assembly of queens.

source: གཟུགས་བཟང་བ་མཛེས་པ་བལྟ་ན་སྡུག་པ་ལྷའི་བུ་མོའི་གཟུགས་དང་འདྲ་བ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་པ་ཤ་སྟག་གོ། །
en: Every single one of them had an excellent body; was gorgeous, beautiful, and looked like a goddess; and had also set forth toward unsurpassed and perfect awakening.

source: དེ་ལ་བུ་སྟོང་ཡོད་དེ། དཔའ་བ། རྟུལ་ཕོད་པ། ཡན་ལག་བཟང་པོ་མཆོག་གི་གཟུགས་དང་ལྡན་པ། ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པ། སྲེད་མེད་ཀྱི་བུའི་སྟོབས་ཀྱི་ཤུགས་ཕྱེད་བདོག་པ། སྐྱེས་བུ་ཆེན་པོའི་མཚན་ཉི་ཤུ་རྩ་བརྒྱད་ཀྱིས་ཡན་ལག་རྣམ་པར་སྤྲས་པ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་པ་ཤ་སྟག་གོ། །
en: The king had one thousand sons, each of whom was brave and courageous, had a fine body with excellent features, was capable of defeating his adversaries, had the strength of Nārāyaṇa, was adorned with the twenty-eight marks of a great individual, and had set forth toward unsurpassed and perfect awakening.

source: དེ་ལ་བུ་མོ་བརྒྱད་འབུམ་ཡོད་དེ། གཟུགས་བཟང་བ་མཛེས་པ་བལྟ་ན་སྡུག་པ་ལྷའི་བུ་མོའི་གཟུགས་འདྲ་བ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་པ་ཤ་སྟག་གོ། །
en: He had eight hundred thousand daughters, each of whom had an excellent body; was gorgeous, beautiful, and looked like a goddess; and had set forth toward unsurpassed and perfect awakening.

source: བློ་གྲོས་རྒྱ་མཚོ་རྒྱལ་པོ་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་སྣང་བ་མཐའ་ཡས་དེ་འཁོར་དང་བཅས་པ་ལ་བར་གྱི་བསྐལ་པ་གཉིས་ཀྱི་བར་དུ་རུང་བ་ཁ་ན་མ་ཐོ་བ་མེད་པ་དགེ་སྦྱོང་དང་འཐུན་པ་ཡིད་དུ་འོང་བའི་གོས་དང་། ཟས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་ཡོ་བྱད་རྣམས་ཀྱིས་སྤྱན་དྲངས་པར་གྱུར་ཏོ། །
en: “Sāgaramati, King Pure Domain invited the blessed thus-gone Infinite Light and his assemblies by offering clothing, food, bedding, healing medicine, and provisions to last for two intermediate eons.

source: རྒྱལ་པོ་དེས་བཅོམ་ལྡན་འདས་དེ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་འཁོར་གྱི་ཁྱམས་ཡངས་ཤིང་ཐ་གྲུ་ཆེ་བ། ཆུ་ཞེང་དཔག་ཚད་ལྔ་འབུམ་ཡོད་པ། ས་ཕྱོགས་ནོར་བུ་རིན་པོ་ཆེ་བཻ་དཱུརྱས་སྤྲས་པ། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཕྱི་རས་བསྐོར་བ། ཙན་དན་དམར་པོ་དང་།
en: The offerings were of virtuous origin, fit for mendicants, and pleasing. As an act of veneration of the Blessed One, the king prepared a courtyard, which was vast and open, measured five hundred thousand leagues square, had a patio that was made of precious jewels and set with beryl, and was surrounded with a perimeter fence made of the seven precious substances.

source: ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་གཤིབས་ཏེ་སྦྱར་བ་སྣ་ཚོགས་བལྟ་ན་
en: He prepared arrangements of red sandalwood and uraga sandalwood.

source: སྡུག་པ། ལྷའི་གཞལ་མེད་ཁང་འདྲ་བར་བྱས་སོ། །
en: It was beautiful and like a celestial palace.

source: གཞན་ཡང་དགེ་སློང་གི་དགེ་འདུན་གྱིས་ཡོངས་སུ་སྤྱད་པའི་ཁང་པ་བརྩེགས་པས་ཡ་བྱས་སོ། །
en: He also built millions of homes for the use of the monastic saṅgha.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟར་རྒྱལ་པོ་ཡུན་ཤིན་ཏུ་རྣམ་པར་དག་པ་ལས་གང་གཞན་མི་བྱེད་པར་རྒྱུན་ཏུ་ཚངས་པར་སྤྱད་པ་ཡང་དག་པར་བླངས།
en: Sāgaramati, in this manner King Pure Domain was fully committed to pure conduct with no exceptions.

source: བསླབ་པའི་གནས་ལྔ་ཡོངས་སུ་བཟུང་སྟེ།
en: He upheld the five trainings.

source: བཙུན་མོའི་འཁོར་དང་བཅས་རང་གི་སྐྱེ་བོ་དང་བཅས་གཡོག་འཁོར་དང་བཅས་པས་བར་གྱི་བསྐལ་པ་གཉིས་སུ་བཅོམ་ལྡན་འདས་དེ་ལ་བསྙེན་བཀུར་བྱས་ནས་
en: He and his queens, children, and servants served the Blessed One for two intermediate eons.

source: བར་གྱི་བསྐལ་པ་དེ་གཉིས་འདས་པ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་སྣང་བ་མཐའ་ཡས་དེ་ག་ལ་བ་དེར་སོང་སྟེ་
en: “At that point he approached the blessed thus-gone Infinite Light.

source: ཕྱིན་ནས་བཅོམ་ལྡན་འདས་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ལན་བདུན་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: He bowed to the Blessed One’s feet, circumambulated him seven times, and sat off to one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཀྱང་རྒྱལ་པོ་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་སྣང་བ་མཐའ་ཡས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: King Pure Domain then asked the blessed thus-gone Infinite Light,

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐེག་པ་ཆེན་པོ་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པ་རྣམས་ལགས།
en: ‘Blessed One, how do bodhisattvas come to be free of others’ influence regarding the Great Vehicle?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཁྱད་པར་དུ་མཆི་བས་དེ་ལ་གང་མ་ཆགས་པ་རྣམས་ལགས།
en: Blessed One, how are bodhisattvas unique such that they do not get attached?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བློ་མི་གཡོ་མི་འགྱུར་ཞིང་ཤིན་ཏུ་བརྟན་པ་རྣམས་ལགས།
en: Blessed One, how are the minds of bodhisattvas unmoving, unchanging, and stable?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་དང་ཤེས་རབ་ཡོངས་སུ་དག་པ་རྣམས་ལགས།
en: Blessed One, how are the means and insight of bodhisattvas pure?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྒྱང་རིང་དུའང་ལྟ་ལ་རྩ་བ་ཡང་མ་ཆད་པ་རྣམས་ལགས།
en: Blessed One, how do bodhisattvas take the long-term perspective without losing their roots?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡུལ་ཡང་འབྱོར་ལ་བག་མཆིས་པ་ཡང་མི་འདོར་བ་རྣམས་ལགས།
en: Blessed One, how do bodhisattvas enjoy sense objects without losing their vigilance?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དོན་ཟབ་མོའི་ཚུལ་ལ་མི་སྐྲག་པ་རྣམས་ལགས།
en: Blessed One, how are bodhisattvas not afraid of the meaning of the profound Dharma?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པ་རྣམས་ཞེས་བགྱི།
en: Blessed One, how are bodhisattvas called true bodhisattvas?’

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་ཟེར་སྣང་བ་མཐའ་ཡས་དེས་རྒྱལ་པོ་ཡུལ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “Once he had spoken, the thus-gone, worthy, perfect buddha Infinite Light responded to King Pure Domain,

source: རྒྱལ་པོ་ཆེན་པོ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ། །
en: ‘Great King, listen well and bear what I say in mind, and I will answer this.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་དང་ལྡན་ན་ཐེག་པ་ཆེན་པོ་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པ་རྣམས་ཡིན་ནོ། །
en: “ ‘Great King, if bodhisattva great beings have four qualities, they come to be free of others’ influence regarding the Great Vehicle.

source: མོས་པ་ལས་ངེས་པར་བྱུང་བའི་དད་པ་འཕགས་པ་འཇིག་རྟེན་ལས་འདས་པ་དང་།
en: (1) A transcendent and noble faith that is born from trust;

source: ཕྱིར་མི་ལྡོག་པའི་བརྩོན་འགྲུས་འབར་བས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་བརྩོན་པ་དང་།
en: (2) persistence in ripening beings through a blazing, unswerving diligence;

source: ཤིན་ཏུ་རྣམ་པར་བརྟགས་པའི་བློས་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་རྩེན་པ་དང་།
en: (3) sporting in clairvoyant wisdom through a highly analytical mind;

source: སོ་སོ་ཡང་དག་པར་ཤེས་པ་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་ཆོས་ཐམས་ཅད་ངེས་པར་རྟོགས་པའི་མཚན་ཉིད་དེ།
en: and (4) realizing all phenomena through insight replete with discriminating cognition.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་ཐེག་པ་ཆེན་པོ་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པ་རྣམས་ཡིན་ནོ། །
en: Great King, if bodhisattva great beings have these four qualities, they come to be free of others’ influence regarding the Great Vehicle.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་དང་ལྡན་ན་ཁྱད་པར་དུ་འགྲོ་བས་དེ་ལ་མ་ཆགས་པ་རྣམས་ཡིན་ནོ། །
en: “ ‘Great King, if bodhisattva great beings have four qualities, they will be distinguished such that they do not get attached.

source: བཞི་གང་ཞེ་ན། སེམས་ལས་སུ་རུང་བས་བསམ་གཏན་ལས་ལྡོག་པ་ལ་མཁས་པ་རྣམས་ཡིན།
en: What are these four? (1) Skill in leaving the states of concentration through mental pliancy;

source: གཞན་ལ་བདེ་བ་རབ་ཏུ་སྦྱིན་པས་བདག་བདེ་བ་ལ་མི་ཆགས་པ་རྣམས་ཡིན།
en: (2) being unattached to their own happiness through giving happiness to others;

source: སྙིང་རྗེ་ཆེན་པོ་ལ་རབ་ཏུ་གནས་ཤིང་བྱམས་པ་ཆེན་པོ་ལ་གནས་པ་རྣམས་ཡིན།
en: (3) maintaining great compassion and great love;

source: གོང་ནས་གོང་མའི་ཁྱད་པར་འདོད་པས་རྒྱ་ཆེན་པོ་ལ་མོས་པ་རྣམས་ཡིན་ཏེ།
en: and (4) aspiring to the vast by wishing to continuously excel.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན། ཁྱད་པར་དུ་འགྲོ་བས་དེ་ལ་མ་ཆགས་པ་རྣམས་ཡིན་ནོ། །
en: Great King, if bodhisattva great beings have these four qualities, they will be distinguished such that they do not get attached.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་དང་ལྡན་ན་བློ་མི་གཡོ་མི་འགྱུར་ཞིང་ཤིན་ཏུ་བརྟན་པ་རྣམས་ཡིན་ནོ། །
en: “ ‘Great King, if bodhisattva great beings have four qualities, their minds will be unmoving, unchanging, and stable.

source: བཞི་གང་ཞེ་ན། སྒྱུ་དང་གཡོ་མེད་པའི་བསམ་པ་དང་།
en: What are these four? (1) A mind free from hypocrisy or pretense,

source: བསམ་པ་ཡོངས་སུ་དག་པའི་སྦྱོར་བ་དང་།
en: (2) actions based on a pure mind,

source: སྦྱོར་བ་ལས་མི་ལྡོག་པའི་ལྷག་པའི་བསམ་པ་དང་།
en: (3) altruism that manifests in unswerving endeavor, and

source: ལྷག་པའི་བསམ་པ་མ་བོར་བར་བསྒྲུབ་པ་སྟེ།
en: (4) practicing without ever losing that altruism.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བློ་མི་གཡོ་མི་འགྱུར་ཞིང་ཤིན་ཏུ་བརྟན་པ་རྣམས་ཡིན་ནོ། །
en: Great King, if bodhisattva great beings have these four qualities, their minds will be unmoving, unchanging, and stable.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་དང་ལྡན་ན་ཐབས་དང་ཤེས་རབ་ཡོངས་སུ་དག་པ་རྣམས་ཡིན་ནོ། །
en: “ ‘Great King, if bodhisattva great beings have four qualities, their means and insight are pure.

source: བཞི་གང་ཞེ་ན། སེམས་ཅན་ཐམས་ཅད་ལ་བདག་མེད་པར་ཡང་མཐོང་ལ་བསྡུ་བའི་དངོས་པོ་བཞིས་སེམས་ཅན་རྣམས་ཀྱང་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་།
en: What are these four? (1) Ripening beings with the four means of attraction while seeing all beings to be without a self;

source: ཆོས་ཐམས་ཅད་བརྗོད་དུ་མེད་པར་ཡང་རབ་ཏུ་ཤེས་ལ་ཡི་གེ་དང་ངེས་པའི་ཚིག་གིས་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱང་སྟོན་ཅིང་དམ་པའི་ཆོས་ཀྱང་ཡོངས་སུ་འཛིན་པ་དང་།
en: (2) teaching beings the sublime Dharma and upholding it using letters and words, while knowing the inexpressibility of all phenomena;

source: སངས་རྒྱས་ཐམས་ཅད་ཆོས་ཀྱི་སྐུས་རབ་ཏུ་ཕྱེ་བར་ཡང་མོས་ལ་མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་བསྒྲུབ་པའི་ཕྱིར་བརྩོན་འགྲུས་ཀྱང་ཉམས་པར་མི་བྱེད་པ་དང་།
en: (3) having an unrelenting diligence in order to achieve the major and minor marks of perfection while trusting that all buddhas consist of the Dharma body;

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ལ་ནམ་མཁའི་ངོ་བོ་ཉིད་དུ་ཡང་རྟོག་ལ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་རྩོལ་བའི་རྒྱུན་ཀྱང་མི་གཅོད་པ་སྟེ།
en: and (4) applying continuous effort to purify buddha realms while realizing that all buddha realms have the essence of space.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་ཐབས་དང་ཤེས་རབ་ཡོངས་སུ་དག་པ་རྣམས་ཡིན་ནོ། །
en: Great King, if bodhisattva great beings have these four qualities, their means and insight are pure.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་པོ་འདི་དག་དང་ལྡན་ན་རྒྱང་རིང་དུ་ཡང་ལྟ་ལ། རྩ་བ་ཡང་མ་ཆད་པ་རྣམས་ཡིན་ནོ། །
en: “ ‘Great King, if bodhisattva great beings have four qualities, they take the long-term perspective without losing their roots.

source: བཞི་གང་ཞེ་ན། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཡང་ལྟ་ལ་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱང་མི་འདོར་བ་རྣམས་ཡིན།
en: What are they? (1) Not giving up the mind of awakening while keeping sight of the seat of awakening;

source: སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་ཡང་ལྟ་ལ་རང་གི་ཤེས་པས་ཀྱང་ཞུམ་པ་མེད་པ་རྣམས་ཡིན།
en: (2) never letting their minds become discouraged while keeping sight of the wisdom of buddhahood;

source: ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ་ལ་ཡང་ལྟ་ལ་ཇི་ལྟར་ཐོས་པའི་ཆོས་བསྟན་པས་ཀྱང་ཡོངས་སུ་མི་སྐྱོ་བ་རྣམས་ཡིན།
en: (3) being tireless in teaching the Dharma according to how they heard it, while keeping sight of the turning of the wheel of Dharma;

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ལ་ཡང་ལྟ་ལ་ཚེ་དང་། འཆི་འཕོ་དང་། སྐྱེ་བ་ལ་ཡང་མི་སྨོད་པ་རྣམས་ཡིན་ཏེ།
en: and (4) not disparaging life, death, or rebirth while keeping sight of the great parinirvāṇa.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་རྒྱང་རིང་དུ་ཡང་ལྟ་ཞིང་རྩ་བ་ཡང་མ་ཆད་པ་རྣམས་ཡིན་ནོ། །
en: Great King, if bodhisattva great beings have these four qualities, they take the long-term perspective without losing their roots.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་དང་ལྡན་ན་ཡུལ་ཡང་འབྱོར་ལ་བག་ཡོད་པ་ཡང་མི་འདོར་བ་རྣམས་ཡིན་ནོ། །
en: “ ‘Great King, if bodhisattva great beings have four qualities, they enjoy sense objects without losing their vigilance.

source: མི་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་ཡང་གྱུར་ལ་འདུ་བྱེད་ལ་མི་རྟག་པར་སོ་སོར་རྟོག་པས་ཡུལ་འབྱོར་ཀྱང་བག་མེད་པར་མི་འགྱུར་བ་རྣམས་ཡིན།
en: (1) They enjoy sense objects without losing their vigilance by realizing conditioned things to be impermanent, while acting as a universal monarch to ripen human beings;

source: ལྷ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་དུ་ཡང་འགྱུར་ལ་འདུ་བྱེད་ལ་སྡུག་བསྔལ་བར་སོ་སོར་རྟོག་པས་ཡུལ་འབྱོར་ཀྱང་བག་མེད་པར་མི་འགྱུར་བ་རྣམས་ཡིན།
en: (2) they enjoy sense objects without losing their vigilance by realizing conditioned things to be dissatisfying, while taking the role of Śakra, lord of the gods, to ripen gods;

source: བདུད་ཀྱི་རིས་ཀྱི་ལྷ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བདུད་ཉིད་དུ་ཡང་ཉེ་བར་སྟོན་ལ་ཆོས་ལ་བདག་མེད་པར་སོ་སོར་རྟོག་པས་ཡུལ་འབྱོར་ཀྱང་བག་མེད་པར་མི་འགྱུར་བ་རྣམས་ཡིན།
en: (3) they enjoy sense objects without losing their vigilance by realizing phenomena to be without a self, while displaying themselves as Māra in order to ripen gods of the class of the māras;

source: ཚངས་རིས་ཀྱི་ལྷ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཚངས་པ་དབང་སྒྱུར་དུ་ཡང་གྱུར་ལ་མྱ་ངན་ལས་འདས་པ་ལ་ཞི་བར་རྟོག་པས་ཡུལ་འབྱོར་ཀྱང་བག་མེད་པར་མི་འགྱུར་བ་རྣམས་ཡིན་ཏེ
en: and (4) they enjoy sense objects without losing their vigilance by realizing nirvāṇa to be peace, while receiving coronation as Brahmā in order to ripen gods of the brahmā classes.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་ཡུལ་ཡང་འབྱོར་ལ་བག་ཡོད་པ་ཡང་མི་འདོར་བ་རྣམས་ཡིན་ནོ། །
en: Great King, if bodhisattva great beings have these four qualities, they enjoy sense objects without losing their vigilance.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་དང་ལྡན་ན་དོན་ཟབ་མོའི་ཚུལ་ལ་མི་སྐྲག་པ་རྣམས་ཡིན་ནོ། །
en: “ ‘Great King, if bodhisattva great beings have four qualities, they need not be afraid of the meaning of the profound Dharma.

source: ཡང་དག་པའི་དགེ་བའི་བཤེས་གཉེན་གང་དག་ཕྱི་རོལ་དུ་མི་བྱེད་པར་རྒྱུན་དུ་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཟབ་མོ་འདི་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་ལ་བསྟེན་པ་དང་།
en: (1) Always following the teaching of the profound awakening of buddhahood without disregarding authentic spiritual teachers,

source: མདོ་སྡེ་ཟབ་མོ་ཚུལ་འདི་ལྟ་བུ་དེ་དག་མཉན་པའི་ཕྱིར་དཔག་ཚད་བརྒྱར་ཡང་འགྲོ་བ་དང་།
en: (2) being willing to walk a hundred leagues to hear these profound sūtras,

source: ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་ཀྱི་དོན་ལ་ཚུལ་བཞིན་དུ་དཔྱོད་པ་དང་།
en: (3) properly examining the meaning of the Dharma teachings that they have heard, and

source: དོན་ལ་རྟོན་པ་ཡིན་གྱི་ཚིག་འབྲུ་ལ་རྟོན་པ་མ་ཡིན་པ་སྟེ།
en: (4) relying on the meaning rather than on the words.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་དོན་ཟབ་མོའི་ཚུལ་ལ་མི་སྐྲག་པ་རྣམས་ཡིན་ནོ། །
en: Great King, if bodhisattva great beings have these four qualities, they need not be afraid of the meaning of the profound Dharma.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པ་རྣམས་ཞེས་བྱའོ། །
en: “ ‘Great King, if bodhisattva great beings have four qualities, they are called true bodhisattvas.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་ཚོལ་བ་ལ་བརྩོན་པའི་བརྩོན་འགྲུས་དང་།
en: (1) Diligence that strives in the pursuit of the perfections,

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་བརྩོན་པའི་སྙིང་རྗེ་ཆེན་པོ་དང་།
en: (2) great compassion that strives to ripen all beings,
